//=====================================================================================================================
// Решение: LotusPlatform
// Раздел: Модуль чертежной графики
// Подраздел: Элементы управления
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusEditorSelectorBrush.xaml.cs
*		Элемент-редактор для выбора кисти.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
//---------------------------------------------------------------------------------------------------------------------
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.CAD;
//=====================================================================================================================
namespace Lotus
{
	namespace CAD
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CadControls
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Элемент-редактор для выбора кисти
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public partial class LotusEditorSelectorBrush : ComboBox
		{
			#region ======================================= ОПРЕДЕЛЕНИЕ СВОЙСТВ ЗАВИСИМОСТИ ===========================
			public static readonly DependencyProperty ValueProperty =
					DependencyProperty.Register(nameof(Value), typeof(CCadBrush), typeof(LotusEditorSelectorBrush),
												new PropertyMetadata(null, Value_PropertyChanged));
			#endregion

			#region ======================================= МЕТОДЫ СВОЙСТВ ЗАВИСИМОСТИ ================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Изменение кисти
			/// </summary>
			/// <param name="obj">Источник события</param>
			/// <param name="args">Аргументы события</param>
			//---------------------------------------------------------------------------------------------------------
			private static void Value_PropertyChanged(DependencyObject obj, DependencyPropertyChangedEventArgs args)
			{
				LotusEditorSelectorBrush selector = (LotusEditorSelectorBrush)obj;
				CCadBrush brush = args.NewValue as CCadBrush;
				if (brush == null)
				{
					selector.SelectedIndex = 0;
				}
				else
				{
					for (Int32 i = 0; i < XCadBrushManager.Brushes.Count; i++)
					{
						if (XCadBrushManager.Brushes[i].Id == brush.Id)
						{
							selector.SelectedIndex = i;
							break;
						}

					}
				}
			}
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Кисть
			/// </summary>
			public CCadBrush Value
			{
				get { return (CCadBrush)GetValue(ValueProperty); }
				set { SetValue(ValueProperty, value); }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public LotusEditorSelectorBrush()
			{
				InitializeComponent();
				SetResourceReference(StyleProperty, typeof(ComboBox));

				this.ItemsSource = XCadBrushManager.Brushes;
			}
			#endregion

			#region ======================================= ОБРАБОТЧИКИ СОБЫТИЙ =======================================
			//-------------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Изменение выбора объекта
			/// </summary>
			/// <param name="sender">Источник события</param>
			/// <param name="args">Аргументы события</param>
			//-------------------------------------------------------------------------------------------------------------
			private void OnComboBox_SelectionChanged(Object sender, SelectionChangedEventArgs args)
			{
				Value = SelectedItem as CCadBrush;
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================