//=====================================================================================================================
// Решение: LotusPlatform
// Раздел: Модуль чертежной графики
// Подраздел: Ресурсы для отображения графического объекта
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCADVisualFontCommon.cs
*		Общие параметры шрифта и текста.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.01.2022
//=====================================================================================================================
using System;
using System.Collections.ObjectModel;
using System.ComponentModel;
using System.ComponentModel.DataAnnotations;
using System.IO;
using System.Xml;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace CAD
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CadVisual
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Выравнивание текста по горизонтали
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TCadTextHorizontalAlignment
		{
			/// <summary>
			/// По левому краю
			/// </summary>
			Left,

			/// <summary>
			/// По правому краю
			/// </summary>
			Right,

			/// <summary>
			/// По центру
			/// </summary>
			Center,

			/// <summary>
			/// По ширине
			/// </summary>
			Justify
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Выравнивание текста по вертикали
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TCadTextVerticalAlignment
		{
			/// <summary>
			/// Выравнивание по верхнему краю
			/// </summary>
			Top,

			/// <summary>
			/// Выравнивание по нижнему краю
			/// </summary>
			Bottom,

			/// <summary>
			/// Выравнивание по центру
			/// </summary>
			Middle
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Режим обрезки текста
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TCadTextTrimming
		{
			/// <summary>
			/// Обрезка отключена
			/// </summary>
			None,

			/// <summary>
			/// Текст обрезается в пределах символа. Многоточие (...) обращается в место оставшегося текста
			/// </summary>
			CharacterEllipsis,

			/// <summary>
			/// Текст обрезается по границе слова. Многоточие (...) обращается в место оставшегося текста
			/// </summary>
			WordEllipsis
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Наклон шрифта
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TCadFontStyle
		{
			/// <summary>
			/// Обычное начертание
			/// </summary>
			Normal,

			/// <summary>
			/// Курсивное начертание
			/// </summary>
			/// <remarks>
			/// Искусственный способ создания курсивного текста на компьютере, в котором нет необходимого курсивного шрифта
			/// </remarks>
			Oblique,

			/// <summary>
			/// Курсивное начертание
			/// </summary>
			Italic
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Коэффициент растяжения или сжатия шрифта
		/// </summary>
		/// <remarks>Растяжение шрифта является особенностью OpenType, которая не поддерживается многими гарнитурами</remarks>
		//-------------------------------------------------------------------------------------------------------------
		public enum TCadFontStretch
		{
			/// <summary>
			/// Предварительно растянутый шрифт: Не известно (0)
			/// </summary>
			Undefined,

			/// <summary>
			/// Предварительно растянутый шрифт: Ультра-сгущенный (1)
			/// </summary>
			UltraCondensed,

			/// <summary>
			/// Предварительно растянутый шрифт : Экстра-сокращенный (2)
			/// </summary>
			ExtraCondensed,

			/// <summary>
			/// Предварительно растянутый шрифт : Сокращенный (3)
			/// </summary>
			Condensed,

			/// <summary>
			/// Предварительно растянутый шрифт : Полу-сокращенный (4)
			/// </summary>
			SemiCondensed,

			/// <summary>
			/// Предварительно растянутый шрифт : Нормальный (5)
			/// </summary>
			Normal,

			/// <summary>
			/// Предварительно растянутый шрифт : Средний (5)
			/// </summary>
			Medium,

			/// <summary>
			/// Предварительно растянутый шрифт : Полу-расширенный (6)
			/// </summary>
			SemiExpanded,

			/// <summary>
			/// Предварительно растянутый шрифт : Расширенный (7)
			/// </summary>
			Expanded,

			/// <summary>
			/// Предварительно растянутый шрифт : Экстра - расширенный (8)
			/// </summary>
			ExtraExpanded,

			/// <summary>
			/// Предварительно растянутый шрифт : Ультра - расширенный (9)
			/// </summary>
			UltraExpanded
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Плотность шрифта
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TCadFontWeight
		{
			/// <summary>
			/// Предварительно настроенная плотность: Тонкий (100)
			/// </summary>
			Thin = 100,

			/// <summary>
			/// Предварительно настроенная плотность: Экстра-легкий (200)
			/// </summary>
			ExtraLight = 200,

			/// <summary>
			/// Предварительно настроенная плотность: Ультра-легкий (200)
			/// </summary>
			UltraLight = 200,

			/// <summary>
			/// Предварительно настроенная плотность: Легкий (300)
			/// </summary>
			Light = 300,

			/// <summary>
			/// Предварительно настроенная плотность: Полу-легкий (350)
			/// </summary>
			SemiLight = 350,

			/// <summary>
			/// Предварительно настроенная плотность: Нормальный (400)
			/// </summary>
			Normal = 400,

			/// <summary>
			/// Предварительно настроенная плотность: Регулярный (400)
			/// </summary>
			Regular = 400,

			/// <summary>
			/// Предварительно настроенная плотность: Средний (500)
			/// </summary>
			Medium = 500,

			/// <summary>
			/// Предварительно настроенная плотность: Полужирный (600)
			/// </summary>
			DemiBold = 600,

			/// <summary>
			/// Предварительно настроенная плотность: Полужирный (600)
			/// </summary>
			SemiBold = 600,

			/// <summary>
			/// Предварительно настроенная плотность: Жирный (700)
			/// </summary>
			Bold = 700,

			/// <summary>
			/// Предварительно настроенная плотность: Экстра-жирный (800)
			/// </summary>
			ExtraBold = 800,

			/// <summary>
			/// Предварительно настроенная плотность: Ультра-жирный (800)
			/// </summary>
			UltraBold = 800,

			/// <summary>
			/// Предварительно настроенная плотность: Черный (900)
			/// </summary>
			Black = 900,

			/// <summary>
			/// Предварительно настроенная плотность: Тяжелый (900)
			/// </summary>
			Heavy = 900,

			/// <summary>
			/// Предварительно настроенная плотность: Экстра-черный (950)
			/// </summary>
			ExtraBlack = 950,

			/// <summary>
			/// Предварительно настроенная плотность: Ультра-черный (950)
			/// </summary>
			UltraBlack = 950
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================