//=====================================================================================================================
// Решение: LotusPlatform
// Раздел: Модуль чертежной графики
// Подраздел: Элементы управления
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusLayerManager.xaml.cs
*		Менеджер управления слоями.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.Linq;
//---------------------------------------------------------------------------------------------------------------------
using System.Windows;
using System.Windows.Controls;
using System.Windows.Input;
using System.Windows.Data;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace CAD
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CadControls
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Менеджер управления слоями
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public partial class LotusLayerManager : UserControl
		{
			#region ======================================= ДАННЫЕ ====================================================
			private ListCollectionView mCollectionViewLayers;
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public LotusLayerManager()
			{
				InitializeComponent();

				if (XCadLayerManager.Layers == null) XCadLayerManager.Init();
				mCollectionViewLayers = new ListCollectionView(XCadLayerManager.Layers);
				mCollectionViewLayers.GroupDescriptions.Add(new PropertyGroupDescription(nameof(CCadLayer.Group)));
				dataLayers.ItemsSource = mCollectionViewLayers;
			}
			#endregion

			#region ======================================= УПРАВЛЕНИЕ СЛОЯМИ =========================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Выбор слоя для редактирования свойств
			/// </summary>
			/// <param name="sender">Источник события</param>
			/// <param name="args">Аргументы события</param>
			//---------------------------------------------------------------------------------------------------------
			private void OnLayerManager_SelectionChanged(Object sender, SelectionChangedEventArgs args)
			{
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Двойной щелчок по объекту - Выбор слоя для редактирования свойств
			/// </summary>
			/// <param name="sender">Источник события</param>
			/// <param name="args">Аргументы события</param>
			//---------------------------------------------------------------------------------------------------------
			private void OnLayerManager_MouseDoubleClick(Object sender, MouseButtonEventArgs args)
			{

			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Добавление кисти к проекту
			/// </summary>
			/// <param name="sender">Источник события</param>
			/// <param name="args">Аргументы события</param>
			//---------------------------------------------------------------------------------------------------------
			private void OnLayerManager_Add(Object sender, RoutedEventArgs args)
			{
				XCadLayerManager.Add("Слой новый", "Пользовательские", -1);
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Удаление контура из проекта
			/// </summary>
			/// <param name="sender">Источник события</param>
			/// <param name="args">Аргументы события</param>
			//---------------------------------------------------------------------------------------------------------
			private void OnLayerManager_Remove(Object sender, RoutedEventArgs args)
			{
				CCadLayer layer = mCollectionViewLayers.CurrentItem as CCadLayer;
				if (layer != null)
				{
					XCadLayerManager.Remove(layer);
				}
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================