//=====================================================================================================================
// Решение: LotusPlatform
// Раздел: Модуль чертежной графики
// Подраздел: Инструменты создания и редактирования графических элементов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCADToolCreateRect.cs
*		Инструмент для создания прямоугольника.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.01.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Maths;
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace CAD
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CadTools
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Инструмент для создания прямоугольника
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CCadToolCreateRect : CCadToolCreate<CCadShapeRect>
		{
			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="canvas_viewer">Интерфейс элемента пользовательского интерфейса для управления канвой</param>
			//---------------------------------------------------------------------------------------------------------
			public CCadToolCreateRect(ICadCanvasViewer canvas_viewer)
				: base(canvas_viewer)
			{
			}
			#endregion

			#region ======================================= CЛУЖЕБНЫЕ МЕТОДЫ ==========================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Начало создания прямоугольника
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			//---------------------------------------------------------------------------------------------------------
			protected void StartCreateRect(ref Vector2Df pos)
			{
				// Создаем прямоугольник
				mElement = new CCadShapeRect();
				mElement.CanvasViewer = mCanvasViewer;
				mElement.IDraft = mCanvasViewer.Draft;
				mElement.mIsCreating = true;

				// Добавляем на канву и в чертеж
				CanvasViewer.AddObject(mElement);

				// Если была включена привязка
				Vector2Df result = mCanvasViewer.SnapIsExsisting ? mCanvasViewer.SnapPoint : pos;
				mElement.CreateStartRect(ref result);

				// Начало рисования прямоугольника
				mIsCreateElement = true;
				mCanvasViewer.SetCursor(TCursor.Cross);
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Окончание создания прямоугольника
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			//---------------------------------------------------------------------------------------------------------
			protected void EndCreateRect(ref Vector2Df pos)
			{
				mIsCreateElement = false;
				mCanvasViewer.SetCursor(TCursor.Arrow);

				// Если была включена привязка
				Vector2Df result = mCanvasViewer.SnapIsExsisting ? mCanvasViewer.SnapPoint : pos;

				mElement.CreateEndRect(ref result);
				mElement.mIsCreating = false;

				// Сохраняем в историю
				mCanvasViewer.Memento.AddStateToHistory(new CMementoCaretakerAdd(mCanvasViewer, mElement));

				mElement = null;
			}
			#endregion

			#region ======================================= ОБЩИЕ МЕТОДЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Нажатие кнопки мыши (Начало создание прямоугольника)
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			/// <param name="button">Кнопка мыши связанная с данным событием</param>
			//---------------------------------------------------------------------------------------------------------
			public override void OnMouseDown(ref Vector2Df pos, TMouseButton button)
			{
				// Создания прямоугольника
				if (button == TMouseButton.Left)
				{
					if (mCanvasViewer.CreateModeIsAutoCAD)
					{
						if (mIsCreateElement == false)
						{
							StartCreateRect(ref pos);
						}
						else
						{
							EndCreateRect(ref pos);
						}
					}
					else
					{
						StartCreateRect(ref pos);
					}
				}
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Перемещение мыши (Продолжение создание прямоугольника)
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			/// <param name="button">Кнопка мыши связанная с данным событием</param>
			//---------------------------------------------------------------------------------------------------------
			public override void OnMouseMove(ref Vector2Df pos, TMouseButton button)
			{
				if (mIsCreateElement)
				{
					mElement.CreateContinueRect(ref pos);
				}
				else
				{
					// Если выключен режим привязки
					if (mCanvasViewer.SnapIsEnabled)
					{
						// Перерисовываем канву
						//mCanvas.Update();
					}
				}
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Отпускание кнопки мыши
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			/// <param name="button">Кнопка мыши связанная с данным событием</param>
			//---------------------------------------------------------------------------------------------------------
			public override void OnMouseUp(ref Vector2Df pos, TMouseButton button)
			{
				if (button == TMouseButton.Left && mIsCreateElement)
				{
					if (!mCanvasViewer.CreateModeIsAutoCAD)
					{
						EndCreateRect(ref pos);
					}
				}
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================