//=====================================================================================================================
// Решение: LotusPlatform
// Раздел: Модуль чертежной графики
// Подраздел: Инструменты создания и редактирования графических элементов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCADToolCreateLine.cs
*		Инструмент для создания линии.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Maths;
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace CAD
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CadTools
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Инструмент для создания линии
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CCadToolCreateLine : CCadToolCreate<CCadShapeLine>
		{
			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="canvas_viewer">Интерфейс элемента пользовательского интерфейса для управления канвой</param>
			//---------------------------------------------------------------------------------------------------------
			public CCadToolCreateLine(ICadCanvasViewer canvas_viewer)
				: base(canvas_viewer)
			{
			}
			#endregion

			#region ======================================= CЛУЖЕБНЫЕ МЕТОДЫ ==========================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Начало создания линии
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			//---------------------------------------------------------------------------------------------------------
			protected void StartCreateLine(ref Vector2Df pos)
			{
				// Создаем линию
				mElement = new CCadShapeLine();
				mElement.CanvasViewer = mCanvasViewer;
				mElement.IDraft = mCanvasViewer.Draft;
				mElement.mIsCreating = true;

				// Добавляем на канву и в чертеж
				CanvasViewer.AddObject(mElement);

				// Если была включена привязка
				mElement.mStartPoint = mCanvasViewer.SnapIsExsisting ? mCanvasViewer.SnapPoint : pos;
				mElement.mEndPoint = pos;

				// Начало рисования линии
				mIsCreateElement = true;
				CanvasViewer.SetCursor(TCursor.Cross);
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Окончание создания линии
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			//---------------------------------------------------------------------------------------------------------
			protected void EndCreateLine(ref Vector2Df pos)
			{
				mIsCreateElement = false;
				CanvasViewer.SetCursor(TCursor.Arrow);

				// Если была включена привязка
				mElement.mEndPoint = mCanvasViewer.SnapIsExsisting ? mCanvasViewer.SnapPoint : pos;
				mElement.mIsCreating = false;

				// Сохраняем в историю
				CanvasViewer.Memento.AddStateToHistory(new CMementoCaretakerAdd(CanvasViewer, mElement));

				mElement = null;
			}
			#endregion

			#region ======================================= ОБЩИЕ МЕТОДЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Нажатие кнопки мыши (Начало создание линии)
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			/// <param name="button">Кнопка мыши связанная с данным событием</param>
			//---------------------------------------------------------------------------------------------------------
			public override void OnMouseDown(ref Vector2Df pos, TMouseButton button)
			{
				// Создания линии
				if (button == TMouseButton.Left)
				{
					if (mCanvasViewer.CreateModeIsAutoCAD)
					{
						if (mIsCreateElement == false)
						{
							StartCreateLine(ref pos);
						}
						else
						{
							EndCreateLine(ref pos);
						}
					}
					else
					{
						StartCreateLine(ref pos);
					}
				}
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Перемещение мыши (Продолжение создание линии)
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			/// <param name="button">Кнопка мыши связанная с данным событием</param>
			//---------------------------------------------------------------------------------------------------------
			public override void OnMouseMove(ref Vector2Df pos, TMouseButton button)
			{
				if (mIsCreateElement)
				{
					mElement.mEndPoint = pos;
				}
				else
				{
					// Если выключен режим привязки
					if (mCanvasViewer.SnapIsEnabled)
					{
						// Перерисовываем канву
						//mCanvas.Update();
					}
				}
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Отпускание кнопки мыши
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			/// <param name="button">Кнопка мыши связанная с данным событием</param>
			//---------------------------------------------------------------------------------------------------------
			public override void OnMouseUp(ref Vector2Df pos, TMouseButton button)
			{
				if (button == TMouseButton.Left && mIsCreateElement)
				{
					if(!mCanvasViewer.CreateModeIsAutoCAD)
					{
						EndCreateLine(ref pos);
					}
				}
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================