//=====================================================================================================================
// Решение: LotusPlatform
// Раздел: Модуль чертежной графики
// Подраздел: Общая подсистема
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCADSerializationCommon.cs
*		Определение типов и методов для сериализации классов и данных модуля чертежной графики.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.01.2022
//=====================================================================================================================
using System;
using System.Xml;
using System.Collections.Generic;
using System.Collections.ObjectModel;
using System.Globalization;
using System.Reflection;
using System.ComponentModel;
//---------------------------------------------------------------------------------------------------------------------
using Newtonsoft.Json;
using Newtonsoft.Json.Serialization;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Maths;
//=====================================================================================================================
namespace Lotus
{
	namespace CAD
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CadDrawing
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс реализующий методы сериализации классов и данных модуля чертежной графики
		/// </summary>
		/// <remarks>
		/// Для обеспечения большей гибкости и универсальности сериализация базовых классов и данных
		/// модуля чертежной графики в формате XML предусмотрена только в формате атрибутов элементов XML
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public static class XCadSerialization
		{
			#region ======================================= ЗАПИСЬ/ЧТЕНИЕ ИЗ БИНАРНОГО ПОТОКА =========================

			#region ======================================= ЗАПИСЬ ДАННЫХ =============================================
			#endregion

			#region ======================================= ЧТЕНИЕ ДАННЫХ =============================================
			#endregion

			#endregion

			#region ======================================= ЗАПИСЬ/ЧТЕНИЕ ИЗ ПОТОКА XML ===============================

			#region ======================================= ЗАПИСЬ ДАННЫХ =============================================
			#endregion

			#region ======================================= ЧТЕНИЕ ДАННЫХ =============================================
			#endregion

			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================