//=====================================================================================================================
// Решение: LotusPlatform
// Раздел: Модуль чертежной графики
// Подраздел: Общая подсистема
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCADCommonDimension.cs
*		Определения системы единиц модуля чертежной графики.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.01.2022
//=====================================================================================================================
using System;
using System.ComponentModel;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace CAD
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CadDrawing
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Единица измерения в области канвы
		/// </summary>
		/// <remarks>
		/// Задает единиц измерения при рисовании на канве. При размещении графических элементов любая единица
		/// измерения приводится к аппаратно-независимым единицам
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		[TypeConverter(typeof(EnumToStringConverter<TCadDimensionType>))]
		public enum TCadDimensionType
		{
			/// <summary>
			/// Аппаратно-независимые единицы (96 точек на дюйм)
			/// </summary>
			[Description("Аппаратная единица")]
			DeviceUnit,

			/// <summary>
			/// Миллиметр
			/// </summary>
			[Description("Миллиметр")]
			Milliliter,

			/// <summary>
			/// Сантиметр
			/// </summary>
			[Description("Сантиметр")]
			Centimeter,

			/// <summary>
			/// Пользовательская единица измерения
			/// </summary>
			/// <remarks>
			/// Будет считается как масштаб к единице измерения миллиметр
			/// </remarks>
			[Description("Пользовательская единица")]
			User
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Базовый интерфейс для определения размерности измеряемых величин
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ICadDimension
		{
			/// <summary>
			/// Единица измерения
			/// </summary>
			TCadDimensionType DimensionType { get; set; }
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Расширенный интерфейс для определения размерности измеряемых величин и управления
		/// пользовательским масштабом
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ICadDimensionEx : ICadDimension
		{
			/// <summary>
			/// Масштаб пользовательской единицы измерения к миллиметру
			/// </summary>
			Double DimensionUserScale { get; set; }
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================