//=====================================================================================================================
// Решение: LotusPlatform
// Раздел: Модуль чертежной графики
// Подраздел: Общая подсистема
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCADCommonSettings.cs
*		Определение глобальных данных и настроек модуля чертежной графики.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.01.2022
//=====================================================================================================================
using System;
using System.Xml;
using System.Collections.Generic;
using System.Collections.ObjectModel;
using System.Globalization;
using System.Reflection;
using System.ComponentModel;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Maths;
//=====================================================================================================================
namespace Lotus
{
	namespace CAD
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CadDrawing
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для хранения глобальных данных и настроек модуля чертежной графики
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XCadSettings
		{
			/// <summary>
			/// Максимальное значение разных константных объектов на один тип
			/// </summary>
			/// <remarks>
			/// Уникальные идентификаторы объектов модуля чертежной графики с меньшем значением
			/// являются константными объектами
			/// </remarks>
			public const Int32 ConstObjectFromID = 1000;
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================