//=====================================================================================================================
// Решение: LotusPlatform
// Раздел: Модуль чертежной графики
// Подраздел: Общая подсистема
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCADCommonPaper.cs
*		Реализация формата листа чертежной графики.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.Collections.ObjectModel;
using System.Globalization;
using System.Reflection;
using System.ComponentModel;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Maths;
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace CAD
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CadDrawing
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Ориентация листа
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		[TypeConverter(typeof(EnumToStringConverter<TCadPaperOrientation>))]
		public enum TCadPaperOrientation
		{
			/// <summary>
			/// Книжная
			/// </summary>
			[Description("Книжная")]
			Portrait,

			/// <summary>
			/// Альбомная
			/// </summary>
			[Description("Альбомная")]
			Landscape
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Представление формата листа
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CCadPaperFormat
		{
			#region ======================================= ДАННЫЕ ====================================================
			// Основные параметры
			internal Int32 mWidth;
			internal Int32 mHeight;
			internal String mNameFormat;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			//
			// ОСНОВНЫЕ ПАРАМЕТРЫ
			//
			/// <summary>
			/// Имя формата листа
			/// </summary>
			[DisplayName("Имя формата")]
			[Category("1) Идентификация")]
			[Description("Имя формата листа")]
			public String NameFormat
			{
				get { return (mNameFormat); }
			}


			/// <summary>
			/// Ширина листа в мм
			/// </summary>
			[DisplayName("Ширина")]
			[Category("2) Размеры")]
			[Description("Ширина листа в мм")]
			public Int32 Width
			{
				get { return (mWidth); }
			}

			/// <summary>
			/// Высота листа в мм
			/// </summary>
			[DisplayName("Высота")]
			[Category("2) Размеры")]
			[Description("Высота листа в мм")]
			public Int32 Height
			{
				get { return (mHeight); }
			}

			/// <summary>
			/// Ширина листа в условных единицах
			/// </summary>
			[DisplayName("Ширина")]
			[Category("2) Размеры")]
			[Description("Ширина листа в условных единицах")]
			public Single WidthUnit
			{
				get { return (XCadDrawing.ToDeviceUnits(mWidth)); }
			}

			/// <summary>
			/// Высота листа в условных единицах
			/// </summary>
			[DisplayName("Высота")]
			[Category("2) Размеры")]
			[Description("Высота листа в условных единицах")]
			public Single HeightUnit
			{
				get { return (XCadDrawing.ToDeviceUnits(mHeight)); }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public CCadPaperFormat()
			{
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="name_format">Имя формата</param>
			/// <param name="width">Ширина листа в мм</param>
			/// <param name="height">Высота листа в мм</param>
			//---------------------------------------------------------------------------------------------------------
			public CCadPaperFormat(String name_format, Int32 width, Int32 height)
			{
				mNameFormat = name_format;
				mWidth = width;
				mHeight = height;
			}
			#endregion

			#region ======================================= СИСТЕМНЫЕ МЕТОДЫ ==========================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Преобразование к текстовому представлению
			/// </summary>
			/// <returns>Имя формата листа</returns>
			//---------------------------------------------------------------------------------------------------------
			public override String ToString()
			{
				return (mNameFormat);
			}
			#endregion
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для управления доступными форматами листов
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XCadPaperManager
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal static ObservableCollection<CCadPaperFormat> mFormats;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Список доступных форматов листа
			/// </summary>
			public static ObservableCollection<CCadPaperFormat> Formats
			{
				get 
				{
					if (mFormats == null)
					{
						Init();
					}
					return (mFormats);
				}
			}

			/// <summary>
			/// Произвольный формат листа по умолчанию
			/// </summary>
			public static CCadPaperFormat Custom
			{
				get
				{
					if(mFormats == null)
					{
						Init();
					}
					return (mFormats[0]);
				}
			}
			#endregion

			#region ======================================= МЕТОДЫ ====================================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Первоначальная инициализация стандартных форматов листов
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public static void Init()
			{
				mFormats = new ObservableCollection<CCadPaperFormat>();
				mFormats.Add(new CCadPaperFormat("Customs", 420, 420));
				mFormats.Add(new CCadPaperFormat("А4А", 297, 210));
				mFormats.Add(new CCadPaperFormat("А4К", 210, 297));
				mFormats.Add(new CCadPaperFormat("А3А", 420, 297));
				mFormats.Add(new CCadPaperFormat("А3К", 297, 420));
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Добавление формата листа к списку
			/// </summary>
			/// <param name="name_format">Имя формата</param>
			/// <param name="width">Ширина листа в мм</param>
			/// <param name="height">Высота листа в мм</param>
			/// <returns>Добавленный формат листа</returns>
			//---------------------------------------------------------------------------------------------------------
			public static CCadPaperFormat AddPaperFormat(String name_format, Int32 width, Int32 height)
			{
				CCadPaperFormat paper = new CCadPaperFormat(name_format, width, height);
				mFormats.Add(paper);
				return (paper);
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================