//=====================================================================================================================
// Решение: LotusPlatform
// Раздел: Модуль чертежной графики
// Подраздел: Общая подсистема
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCADViewEntity.cs
*		Элемент отображения для элемента чертежной графики.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.01.2022
//=====================================================================================================================
using System;
using System.ComponentModel;
using System.Collections.ObjectModel;
using System.Globalization;
using System.ComponentModel.DataAnnotations;
using System.IO;
using System.Xml;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace CAD
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CadDrawing
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс реализующий элемент отображения для элемента чертежной графики
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CViewItemHierarchyCadEntity : ViewItemHierarchy<ICadEntity>
		{
			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public CViewItemHierarchyCadEntity()
				: this(String.Empty)
			{

			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="name">Имя модели</param>
			//---------------------------------------------------------------------------------------------------------
			public CViewItemHierarchyCadEntity(String name)
				: base(name)
			{
				SetContextMenu();
				mIsNotify = true;
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="data_context">Данные</param>
			//---------------------------------------------------------------------------------------------------------
			public CViewItemHierarchyCadEntity(ICadEntity data_context)
				: base(data_context)
			{
				SetContextMenu();
				mIsNotify = true;
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="data_context">Данные</param>
			/// <param name="parent_item">Родительский узел</param>
			//---------------------------------------------------------------------------------------------------------
			public CViewItemHierarchyCadEntity(ICadEntity data_context, ILotusViewItemHierarchy parent_item)
				: base(data_context, parent_item)
			{
				SetContextMenu();
				mIsNotify = true;
			}
			#endregion

			#region ======================================= МЕТОДЫ ILotusViewItem =====================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Открытие контекстного меню
			/// </summary>
			/// <param name="context_menu">Контекстное меню</param>
			//---------------------------------------------------------------------------------------------------------
			public override void OpenContextMenu(System.Object context_menu)
			{
#if USE_WINDOWS
				//if(context_menu is System.Windows.Controls.ContextMenu window_context_menu)
				//{
				//	mUIContextMenu.SetCommandsDefault(window_context_menu);
				//}
#endif
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Создание экземпляра элемента отображения
			/// </summary>
			/// <returns>Элемент отображения</returns>
			//---------------------------------------------------------------------------------------------------------
			public override ILotusViewItem CreateViewItem()
			{
				return (new CViewItemHierarchyCadEntity());
			}
			#endregion

			#region ======================================= МЕТОДЫ ILotusViewItemHierarchy ============================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Проверка на поддержку элемента отображения
			/// </summary>
			/// <param name="view_item">Элемент отображения</param>
			/// <returns>Статус поддрежки</returns>
			//---------------------------------------------------------------------------------------------------------
			public override Boolean IsSupportViewItem(ILotusViewItemHierarchy view_item)
			{
				if(DataContext is CCadProject && view_item.DataContext is ICadDraft)
				{
					return (true);
				}
				if (DataContext is ICadDraft && view_item.DataContext is ICadObject)
				{
					return (true);
				}

				return (false);
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Создание экземпляра иерархического элемента отображения
			/// </summary>
			/// <returns>Элемент отображения</returns>
			//---------------------------------------------------------------------------------------------------------
			public override ILotusViewItemHierarchy CreateViewItemHierarchy()
			{
				return (new CViewItemHierarchyCadEntity());
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Построение дочерней иерархии согласно источнику данных
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public override void BuildFromDataContext()
			{
				Clear();
				CCollectionViewHierarchyCadEntity.BuildFromParent(this, mOwner);
			}
			#endregion

			#region ======================================= ОБЩИЕ МЕТОДЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установка контекстного меню
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public void SetContextMenu()
			{
				mUIContextMenu = new CUIContextMenu();
				mUIContextMenu.ViewItem = this;
				mUIContextMenu.AddItem("Показать в проводнике", (ILotusViewItem view_item) =>
				{
#if USE_WINDOWS
					Windows.XNative.ShellExecute(IntPtr.Zero,
						"explore",
						DataContext.Name,
						"",
						"",
						Windows.TShowCommands.SW_NORMAL);
#else

#endif
				});
				mUIContextMenu.AddItem(CUIContextMenu.Remove.Duplicate());
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================