//=====================================================================================================================
// Решение: LotusPlatform
// Раздел: Модуль чертежной графики
// Подраздел: Графические примитивы
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusWindowsCADPrimitiveImage.cs
*		Графический примитив изображения.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Linq;
using System.Collections.Generic;
using System.ComponentModel;
using System.Globalization;
using System.Windows;
using System.Windows.Media;
using System.Windows.Media.Imaging;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
using Lotus.Maths;
using Lotus.Windows;
//=====================================================================================================================
namespace Lotus
{
	namespace CAD
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CadPrimitivs
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Графический примитив изображения
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CCadWindowsPrimitiveImage : CCadPrimitiveImage
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal BitmapImage mBitmap;
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public CCadWindowsPrimitiveImage()
			{
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="file_name">Имя файла изображения</param>
			/// <param name="start_point">Начальная точка</param>
			//---------------------------------------------------------------------------------------------------------
			public CCadWindowsPrimitiveImage(String file_name, Vector2Df start_point)
			{
				mBoundsRect.PointTopLeft = start_point;
				mSource.PathData = file_name;
				mSource.TypeData = TCadImageSourceType.File;
			}
			#endregion

			#region ======================================= ОБЩИЕ МЕТОДЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Обновление данных источника изображения
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public override void UpdateImageSource()
			{
				if (mSource.IsCorrectPath)
				{
					if (mSource.TypeData == TCadImageSourceType.File)
					{
						mBitmap = XWindowsLoaderBitmap.LoadBitmapFromFile(mSource.PathData) as BitmapImage;
					}
					else
					{
						mBitmap = XWindowsLoaderBitmap.LoadBitmapFromResource(mSource.PathData) as BitmapImage;
					}
				}
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Обновление данных поворота изображения
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public override void UpdateRotationSource()
			{
				
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Обновление данных изображения
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public override void Update()
			{

			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Копирование графического примитива
			/// </summary>
			/// <returns>Дубликат графического примитива со всеми параметрами и данными</returns>
			//---------------------------------------------------------------------------------------------------------
			public override CCadPrimitive Duplicate()
			{
				CCadWindowsPrimitiveImage image = new CCadWindowsPrimitiveImage();
				image.CopyParamemtrs(this);
				image.Update();
				image.UpdateImageSource();
				image.UpdateRotationSource();
				return (image);
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Копирование параметров с графического примитива
			/// </summary>
			/// <param name="primitiv">Графический примитив</param>
			//---------------------------------------------------------------------------------------------------------
			public override void CopyParamemtrs(CCadPrimitive primitiv)
			{
				base.CopyParamemtrs(primitiv);

				CCadWindowsPrimitiveImage source = primitiv as CCadWindowsPrimitiveImage;

				mSource = source.mSource;
				mRotationAngle = source.mRotationAngle;
			}
			#endregion

			#region ======================================= МЕТОДЫ РИСОВАНИЯ ==========================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Рисование изображения
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public override void Draw()
			{
				//if (mIsFilled)
				//{
				//	LotusCadCanvas.DrawingDevice.DrawRectangle(mFill.WindowsBrush, null, mBoundsRect.ToWinRect());
				//}

				//LotusCadCanvas.DrawingDevice.DrawImage(mBitmap, mBoundsRect.ToWinRect());

				//if (mIsStroked)
				//{
				//	LotusCadCanvas.DrawingDevice.DrawRectangle(null, mStroke.WindowsPen, mBoundsRect.ToWinRect());
				//}
				
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================