//=====================================================================================================================
// Решение: LotusPlatform
// Раздел: Модуль чертежной графики
// Подраздел: Инструменты создания и редактирования графических элементов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCADToolCreateArc.cs
*		Инструмент для создания дуги.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 04.04.2021
//=====================================================================================================================
using System;
using System.Collections.Generic;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Maths;
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace CAD
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CadTools
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Инструмент для создания дуги
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CCadToolCreateArc : CCadTool<CCadShapeArc>
		{
			#region ======================================= ДАННЫЕ ====================================================
			private CCadShapeArc mCurrentArc;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public CCadToolCreateArc()
			{
			}
			#endregion

			#region ======================================= CЛУЖЕБНЫЕ МЕТОДЫ ==========================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Начало создания дуги
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			//---------------------------------------------------------------------------------------------------------
			protected void StartCreateArc(ref Vector2Df pos)
			{
				// Создаем дугу
				//mCurrentArc = XCadManager.CreateShape("ShapeArc", "") as CCadShapeArc;

				// Если была включена привязка
				mCurrentArc.CreateStartArc(mCanvasViewer.SnapIsExsisting ? mCanvasViewer.SnapPoint : pos);

				// Начало рисования дуги
				mIsCreateElement = true;
				
				//mCanvas.SetCursor(TCursor.Cross);

				// Если есть активный документ то добавляем в него (на канву добавиться автоматически)
				//if (XManager.PresenterDocument != null)
				//{
				//	//XManager.PresenterDocument.AddExistingElement(mCurrentArc);
				//}
				//else
				//{
				//	XManager.Presenter.Elements.Add(mCurrentArc);
				//}
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Окончание создания дуги
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			//---------------------------------------------------------------------------------------------------------
			protected void EndCreateArc(ref Vector2Df pos)
			{
				mIsCreateElement = false;
				mCanvas.SetCursor(TCursor.Arrow);
				//XManager.MementoManager.AddStateToHistory(new CStateMementoElementAdd(mCurrentArc));

				// Если была включена привязка
				mCurrentArc.CreateEndArc(mCanvasViewer.SnapIsExsisting ? mCanvasViewer.SnapPoint : pos);
				mCurrentArc = null;
			}
			#endregion

			#region ======================================= ОБЩИЕ МЕТОДЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Нажатие кнопки мыши (Начало создание дуги)
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			/// <param name="button">Кнопка мыши связанная с данным событием</param>
			//---------------------------------------------------------------------------------------------------------
			public override void OnMouseDown(ref Vector2Df pos, TMouseButton button)
			{
				// Создания дуги
				if (button == TMouseButton.Left)
				{
					if (mCanvasViewer.CreateModeIsAutoCAD)
					{
						if (mIsCreateElement == false)
						{
							StartCreateArc(ref pos);
						}
						else
						{
							EndCreateArc(ref pos);
						}
					}
					else
					{
						StartCreateArc(ref pos);
					}
				}
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Перемещение мыши (Продолжение создание дуги)
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			/// <param name="button">Кнопка мыши связанная с данным событием</param>
			//---------------------------------------------------------------------------------------------------------
			public override void OnMouseMove(ref Vector2Df pos, TMouseButton button)
			{
				if (mIsCreateElement)
				{
					mCurrentArc.CreateContinueArc(ref pos);
				}
				else
				{
					// Если выключен режим привязки
					if (mCanvasViewer.SnapIsEnabled)
					{
						// Перерисовываем канву
						//mCanvas.Update();
					}
				}
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Отпускание кнопки мыши (Окончание создание дуги)
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			/// <param name="button">Кнопка мыши связанная с данным событием</param>
			//---------------------------------------------------------------------------------------------------------
			public override void OnMouseUp(ref Vector2Df pos, TMouseButton button)
			{
				if (button == TMouseButton.Left && mIsCreateElement)
				{
					if (!mCanvasViewer.CreateModeIsAutoCAD)
					{
						EndCreateArc(ref pos);
					}
				}
			}
			#endregion

			#region ======================================= ОБРАБОТКА СОБЫТИЙ КОНТЕКСТНОГО МЕНЮ =======================
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================