//=====================================================================================================================
// Решение: LotusPlatform
// Раздел: Модуль чертежной графики
// Подраздел: Инструменты создания и редактирования графических элементов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCADTool.cs
*		Базовый инструмент для создания и редактирования графических элементов.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
//---------------------------------------------------------------------------------------------------------------------
using System.Windows;
using System.Windows.Input;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
using Lotus.Maths;
//=====================================================================================================================
namespace Lotus
{
	namespace CAD
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \defgroup CadTools Инструменты
		//! Инструменты создания и редактирования графических элементов
		//! \ingroup CadDrawing
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Базовый инструмент для создания и редактирования графических элементов
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public abstract class CCadTool
		{
			#region ======================================= ДАННЫЕ ====================================================
			protected internal String mActionName;
			protected internal ICadCanvasViewer mCanvasViewer;
			protected internal Boolean mIsComplete = true;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Наименование действия которое осуществляет инструмент
			/// </summary>
			public String ActionName
			{
				get { return (mActionName); }
			}

			/// <summary>
			/// Интерфейс элемента пользовательского интерфейса для управления канвой
			/// </summary>
			public ICadCanvasViewer CanvasViewer
			{
				get { return (mCanvasViewer); }
				set { mCanvasViewer = value; }
			}

			/// <summary>
			/// Статус окончания операции создания/редактирования
			/// </summary>
			public Boolean IsComplete
			{
				get { return (mIsComplete); }
			}
			#endregion

			#region ======================================= МЕТОДЫ ====================================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Нажатие кнопки мыши
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			/// <param name="button">Кнопка мыши</param>
			//---------------------------------------------------------------------------------------------------------
			public abstract void OnMouseDown(ref Vector2Df pos, TMouseButton button);

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Перемещение мыши
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			/// <param name="button">Кнопка мыши</param>
			//---------------------------------------------------------------------------------------------------------
			public abstract void OnMouseMove(ref Vector2Df pos, TMouseButton button);

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Отпускание кнопки мыши
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			/// <param name="button">Кнопка мыши</param>
			//---------------------------------------------------------------------------------------------------------
			public abstract void OnMouseUp(ref Vector2Df pos, TMouseButton button);

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установка курсора
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public virtual void SetCursor()
			{

			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Окончания действия инструмента
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public virtual void ToolActionCompleted()
			{

			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установка контекстного меню к инструменту
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public virtual void SetContextMenu()
			{

			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Отсоединение контекстного меню от инструмента
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public virtual void UnsetContextMenu()
			{
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================