//=====================================================================================================================
// Решение: LotusPlatform
// Раздел: Модуль чертежной графики
// Подраздел: Инструменты создания и редактирования графических элементов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCADToolCreateText.cs
*		Инструмент для создания текста.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 04.04.2021
//=====================================================================================================================
using System;
using System.Collections.Generic;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Maths;
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace CAD
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CadTools
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Инструмент для создания текста
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CCadToolCreateText : CCadTool<CCadShapeText>
		{
			#region ======================================= ДАННЫЕ ====================================================
			protected CCadShapeText mCurrentText;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public CCadToolCreateText()
			{
			}
			#endregion

			#region ======================================= CЛУЖЕБНЫЕ МЕТОДЫ ==========================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Начало создания текста
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			//---------------------------------------------------------------------------------------------------------
			protected void StartCreateText(ref Vector2Df pos)
			{
				// Создаем текст
				//mCurrentText = XCadManager.CreateShape("ShapeText", "") as CCadShapeText;

				// Если была включена привязка
				Vector2Df result = mCanvasViewer.SnapIsExsisting ? mCanvasViewer.SnapPoint : pos;
				mCurrentText.CreateStartRect(ref result);

				// Начало рисования текста
				mIsCreateElement = true;
				mCanvas.SetCursor(TCursor.Cross);

				// Если есть активный документ то добавляем в него (на канву добавиться автоматически)
				//if (XManager.PresenterDocument != null)
				//{
				//	//XManager.PresenterDocument.AddExistingElement(mCurrentText);
				//}
				//else
				//{
				//	XManager.Presenter.Elements.Add(mCurrentText);
				//}
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Окончание создания текста
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			//---------------------------------------------------------------------------------------------------------
			protected void EndCreateText(ref Vector2Df pos)
			{
				mIsCreateElement = false;
				mCanvas.SetCursor(TCursor.Arrow);
				//XManager.MementoManager.AddStateToHistory(new CStateMementoElementAdd(mCurrentText));

				// Если была включена привязка
				Vector2Df result = mCanvasViewer.SnapIsExsisting ? mCanvasViewer.SnapPoint : pos;

				mCurrentText.CreateEndRect(ref result);
				mCurrentText = null;
			}
			#endregion

			#region ======================================= ОБЩИЕ МЕТОДЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Нажатие кнопки мыши (Начало создание текста)
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			/// <param name="button">Кнопка мыши связанная с данным событием</param>
			//---------------------------------------------------------------------------------------------------------
			public override void OnMouseDown(ref Vector2Df pos, TMouseButton button)
			{
				// Создания текста
				if (button == TMouseButton.Left)
				{
					if (mCanvasViewer.CreateModeIsAutoCAD)
					{
						if (mIsCreateElement == false)
						{
							StartCreateText(ref pos);
						}
						else
						{
							EndCreateText(ref pos);
						}
					}
					else
					{
						StartCreateText(ref pos);
					}
				}
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Перемещение мыши (Продолжение создание прямоугольника)
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			/// <param name="button">Кнопка мыши связанная с данным событием</param>
			//---------------------------------------------------------------------------------------------------------
			public override void OnMouseMove(ref Vector2Df pos, TMouseButton button)
			{
				if (mIsCreateElement)
				{
					mCurrentText.CreateContinueRect(ref pos);
				}
				else
				{
					// Если выключен режим привязки
					if (mCanvasViewer.SnapIsEnabled)
					{
						// Перерисовываем канву
						//mCanvas.Update();
					}
				}
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Отпускание кнопки мыши
			/// </summary>
			/// <param name="pos">Позиция курсора в области канвы</param>
			/// <param name="button">Кнопка мыши связанная с данным событием</param>
			//---------------------------------------------------------------------------------------------------------
			public override void OnMouseUp(ref Vector2Df pos, TMouseButton button)
			{
				if (button == TMouseButton.Left && mIsCreateElement)
				{
					if (!mCanvasViewer.CreateModeIsAutoCAD)
					{
						EndCreateText(ref pos);
					}
				}
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================