//=====================================================================================================================
// Решение: LotusPlatform
// Раздел: Модуль чертежной графики
// Подраздел: Ресурсы для отображения графического объекта
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCADVisualStroke.cs
*		Интерфейс для определения объекта чертежной графики поддерживающего/имеющего контур.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.ComponentModel;
using System.IO;
using System.Xml;
using System.Linq;
using System.Collections.Generic;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace CAD
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CadVisual
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс для определения объекта чертежной графики поддерживающего/имеющего контур
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ICadStrokeSupport
		{
			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Отображение контура
			/// </summary>
			/// <remarks>
			/// Свойство определяет надо ли рисовать контур графического объекта
			/// </remarks>
			Boolean StrokeIsEnabled { get; set; }

			/// <summary>
			/// Идентификатор пера для отображения контура объекта чертежной графики
			/// </summary>
			Int64 StrokePenId { get; set; }

			/// <summary>
			/// Названия пера для отображения контура объекта чертежной графики
			/// </summary>
			String StrokePenName { get; set; }

			/// <summary>
			/// Перо для отображения контура объекта чертежной графики
			/// </summary>
			CCadPen StrokePen { get; set; }

			/// <summary>
			/// Переопределение толщины пера
			/// </summary>
			Single StrokeThickness { get; set; }
			#endregion

			#region ======================================= МЕТОДЫ ====================================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установка пера для отображения контура
			/// </summary>
			/// <param name="pen">Перо</param>
			//---------------------------------------------------------------------------------------------------------
			void SetStrokePen(CCadPen pen);
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================