//=====================================================================================================================
// Решение: LotusPlatform
// Раздел: Модуль чертежной графики
// Подраздел: Ресурсы для отображения графического объекта
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCADVisualFill.cs
*		Интерфейс для определения объекта модуля чертежной графики поддерживающего/имеющего заливку.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.01.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.IO;
using System.Xml;
//=====================================================================================================================
namespace Lotus
{
	namespace CAD
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CadVisual
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс для определения объекта модуля чертежной графики поддерживающего/имеющего заливку
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ICadFillSupport
		{
			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Отображение заливки
			/// </summary>
			/// <remarks>
			/// Свойство определяет надо ли заливать графический объект
			/// </remarks>
			Boolean FillIsEnabled { get; set; }

			/// <summary>
			/// Идентификатор кисти для заливки
			/// </summary>
			Int64 FillBrushId { get; set; }

			/// <summary>
			/// Названия кисти для заливки
			/// </summary>
			String FillBrushName { get; set; }

			/// <summary>
			/// Кисть для заливки
			/// </summary>
			CCadBrush FillBrush { get; set; }

			/// <summary>
			/// Прозрачность заливки
			/// </summary>
			Int32 FillOpacity { get; set; }
			#endregion

			#region ======================================= МЕТОДЫ ====================================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установка кисти для заливки
			/// </summary>
			/// <param name="brush">Кисть</param>
			//---------------------------------------------------------------------------------------------------------
			void SetFillBrush(CCadBrush brush);
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================