//=====================================================================================================================
// Решение: LotusPlatform
// Раздел: Модуль чертежной графики
// Подраздел: Общая подсистема
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCADLayerCommon.cs
*		Общие типы и структурны данных для подсистемы слоя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.01.2022
//=====================================================================================================================
using System;
using System.ComponentModel;
using System.Collections.ObjectModel;
using System.Globalization;
using System.ComponentModel.DataAnnotations;
using System.IO;
using System.Xml;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace CAD
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CadDrawing
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Режим видимости слоя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TCadLayerVisibleMode
		{
			/// <summary>
			/// Графические элементы слоя видны (за исключением тех у которых свойство IsVisible равно false)
			/// </summary>
			[Description("Графические элементы слоя видны (за исключением тех у которых свойство IsVisible равно false)")]
			Visible,

			/// <summary>
			/// Все графические элементы слоя видны (даже те у которых свойство IsVisible равно false)
			/// </summary>
			[Description("Все графические элементы слоя видны (даже те у которых свойство IsVisible равно false)")]
			VisibleAll,

			/// <summary>
			/// Графические элементы слоя скрыты
			/// </summary>
			[Description("Графические элементы слоя скрыты")]
			Hidden,

			/// <summary>
			/// Видны только графические элементы у которых свойство IsVisible равно false
			/// </summary>
			[Description("Видны только графические элементы у которых свойство IsVisible равно false")]
			VisibleIsHidden
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Режим полутона отображения слоя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TCadLayerHalftoneMode
		{
			/// <summary>
			/// Полутон отключен, цвет зависит от графического объекта
			/// </summary>
			[Description("Полутон отключен, цвет зависит от графического объекта")]
			Disable,

			/// <summary>
			/// Полутон цвета графического объекта
			/// </summary>
			[Description("Полутон цвета графического объекта")]
			Halftone,

			/// <summary>
			/// Цвет всех графических элементов на слое - полутон серого цвета
			/// </summary>
			[Description("Цвет всех графических элементов на слое - полутон серого цвета")]
			HalftoneGray
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================