//=====================================================================================================================
// Решение: LotusPlatform
// Раздел: Модуль чертежной графики
// Подраздел: Элементы управления
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusPenManager.xaml.cs
*		Менеджер управления перьями.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
//---------------------------------------------------------------------------------------------------------------------
using System.Windows;
using System.Windows.Controls;
using System.Windows.Input;
using System.Windows.Data;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
using Lotus.CAD;
//=====================================================================================================================
namespace Lotus
{
	namespace CAD
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CadControls
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Менеджер управления перьями
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public partial class LotusPenManager : UserControl
		{
			#region ======================================= ДАННЫЕ ====================================================
			private ListCollectionView mCollectionViewPens;
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public LotusPenManager()
			{
				InitializeComponent();

				if (XCadPenStyleManager.PenStyles == null) XCadPenStyleManager.Init();
				if (XCadPenManager.Pens == null) XCadPenManager.Init();
				mCollectionViewPens = new ListCollectionView(XCadPenManager.Pens);
				mCollectionViewPens.GroupDescriptions.Add(new PropertyGroupDescription(nameof(CCadPen.Group)));
				dataPens.ItemsSource = mCollectionViewPens;
			}
			#endregion

			#region ======================================= УПРАВЛЕНИЕ ПЕРЬЯМИ ========================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Выбор пера для редактирования свойств
			/// </summary>
			/// <param name="sender">Источник события</param>
			/// <param name="args">Аргументы события</param>
			//---------------------------------------------------------------------------------------------------------
			private void OnPenManager_SelectionChanged(Object sender, SelectionChangedEventArgs args)
			{
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Двойной щелчок по объекту - Выбор пера для редактирования свойств
			/// </summary>
			/// <param name="sender">Источник события</param>
			/// <param name="args">Аргументы события</param>
			//---------------------------------------------------------------------------------------------------------
			private void OnPenManager_MouseDoubleClick(Object sender, MouseButtonEventArgs args)
			{
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Добавление пера к проекту
			/// </summary>
			/// <param name="sender">Источник события</param>
			/// <param name="args">Аргументы события</param>
			//---------------------------------------------------------------------------------------------------------
			private void OnPenManager_Add(Object sender, RoutedEventArgs args)
			{
				XCadPenManager.Add("Новое", "Пользовательское", XCadBrushManager.Black, 1.0f, XCadPenStyleManager.Solid);
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Удаление пера из проекта
			/// </summary>
			/// <param name="sender">Источник события</param>
			/// <param name="args">Аргументы события</param>
			//---------------------------------------------------------------------------------------------------------
			private void OnPenManager_Remove(Object sender, RoutedEventArgs args)
			{
				CCadPen pen = mCollectionViewPens.CurrentItem as CCadPen;
				if (pen != null)
				{
					XCadPenManager.Remove(pen);
				}
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================